{
  "back": "<== Back",
  "guides": "Guides",
  "articles": "Articles",
  "slogan": "Simple service for learning programming",
  "chooseGuide": "Choose guide",
  "author": "Author",
  "about": "About us",
  "dev-dir": "Develop direction",
  "technologies": "Technologies",
  "frontend": "Frontend",
  "backend": "Backend",
  "mobile-kotlin": "Mobile kotlin",
  "mobile-swift": "Mobile swift",
  "vue-js": "Vue Js",
  "laravel": "Laravel",
  "Kotlin": "kotlin",
  "Swift": "swift",
  "how-learning-faster": "How learning faster ?",
  "what-is-mobile-develop": "What is Mobile develop ?",
  "which-backend-framework-is-best": "Which Backend framework is best?",
  "what-dev-ops-developer-doing": "What Dev ops developer doing ?",
  "frontend-page": {
    "article_1-title": "What is frontend?",
    "paragraph_1-1": "Front-end development is the development of visual and interactive elements of a website that users interact with directly. It's a combination of HTML, CSS and JavaScript, where HTML provides the structure, CSS the styling and layout, and JavaScript the dynamic behaviour and interactivity.",
    "paragraph_1-2": "As a front-end developer, you'll be responsible for creating the user interface of a website, to ensure it looks good and is easy to use, with great focus on design principles and user experience. You'll be working closely with designers, back-end developers, and project managers to make sure the final product meets the client's needs and provides the best possible experience for the end-users.",
    "article_2-title": "Base",
    "article_2-label": "More about base",
    "paragraph_2-1": "HTML is a markup language that defines the structure of your content. HTML consists of a series of elements, which you use to enclose, or wrap, different parts of the content to make it appear a certain way, or act a certain way. ",
    "paragraph_2-2": "Like HTML, CSS is not a programming language. It's not a markup language either. CSS is a style sheet language.",
    "paragraph_2-3": "JavaScript is a programming language that adds interactivity to your website. This happens in games, in the behavior of responses when buttons are pressed or with data entry on forms; with dynamic styling; with animation, etc. ",
    "article_3-title": "Git",
    "article_3-label": "More about Git",
    "paragraph_3-1": "Git is a console utility for tracking and maintaining a history of file changes in your project. Most often it is used for code, but it can be used for other files as well.",
    "paragraph_3-2": "With Git, you can rollback your project to an older version, compare, analyze, or merge your changes into a repository.",
    "paragraph_3-3": "A repository is a repository of your code and a history of its changes. Git works locally and all your repositories are stored in specific folders on your hard drive.",
    "article_4-title": "Frameworks",
    "article_4-label": "More about Frameworks",
    "paragraph_4-1": "Front-end frameworks facilitate web developers' jobs by providing them with reusable code modules, standardized front-end technologies, and ready-made interface blocks that ease the development of applications and user interfaces without the need to code every function or object from scratch.",
    "paragraph_4-2": "As most web applications offer very similar – or sometimes identical – structures, front-end frameworks have been developed to provide a common structure, so developers do not have to write everything from scratch.",
    "paragraph_4-3": "Knowing which front-end framework is the best on the market has always been controversial. However, recent studies and surveys show that currently, the most popular front-end frameworks are React, Vue, Angular, Svelte. ",
    "article_5-title": "Other tools",
    "article_5-label": "More about Other tools",
    "paragraph_5-1": "A CSS framework provides the user with a fully functional CSS stylesheet, allowing them to create a web page by simply coding the HTML with appropriate classes, structure, and IDs.",
    "paragraph_5-2": "Type checker helps developers write code with fewer bugs by adding types to their code, trying to catch type errors within your code, and then removing them during compile time.",
    "paragraph_5-3": "Common usages of task runners include numerous development tasks such as: spinning up development servers, compiling code (ex. SCSS to CSS) and running linters, serving files up from a local port on your computer.",
    "paragraph_5-4": "CSS Preprocessors are scripting languages that extend the default capabilities of CSS.",
    "article_6-title": "Tests",
    "article_6-label": "More about tests",
    "paragraph_6-1": "Before delivering your application to users, you need to be sure that your app meets the requirements it was designed for, and that it doesn`t do any weird, unintended things (called `bugs`).",
    "paragraph_6-2": "There are many types of tests: unit / integration / e2e tests, testing pyramids, red-green refactors, TDD and BDD, screenshot tests.",
    "article_7-title": "Forms of web apps",
    "article_7-label": "More about froms of web apps",
    "paragraph_7-1": "A static site generator is a tool that generates a full static HTML website based on raw data and a set of templates. Essentially, a static site generator automates the task of coding individual HTML pages and gets those pages ready to serve to users ahead of time. Because these HTML pages are pre-built, they can load very quickly in users` browsers.",
    "paragraph_7-2": "Server-side rendering refers to the process that the service side completes the HTML structure splicing of the page, sends it to the browser, and then binds the status and events for it to become a fully interactive page.",
    "paragraph_7-3": "Progressive Web Apps (PWAs) are websites that are progressively enhanced to function like installed, native apps on supporting platforms, while functioning like regular websites on other browsers.",
    "paragraph_7-4": "A while back, developing a mobile app using JavaScript was impossible. But now JavaScript developers can create mobile and desktop using their knowledge for web development."
  }
}
