{
  "back": "<== Назад",
  "guides": "Гайды",
  "articles": "Статьи",
  "slogan": "Простой сервис для изучения програмирования",
  "chooseGuide": "Выбрать гайд",
  "author": "Автор",
  "about": "О проекте",
  "dev-dir": "Направление разработки",
  "Technologies": "Технологии",
  "frontend": "Frontend",
  "backend": "Backend",
  "mobile-kotlin": "Mobile kotlin",
  "mobile swift": "Mobile swift",
  "vue-js": "Vue Js",
  "laravel": "Laravel",
  "Kotlin": "kotlin",
  "Swift": "swift",
  "how-learning-faster": "Как учиться быстрее ?",
  "what-is-mobile-develop": "Что такое мобильная разработка ?",
  "which-backend-framework-is-best": "Какой backend фреймворк лучший ?",
  "what-dev-ops-developer-doing": "Чем занимаються dev ops разработчики ?",
  "frontend-page": {
    "link-label": "start learning",
    "article_1-title": "Что такое frontend?",
    "paragraph_1-1": "Фронтенд-разработка — это разработка визуальных и интерактивных элементов веб-сайта, с которыми пользователи взаимодействуют напрямую. Это комбинация HTML, CSS и JavaScript, где HTML обеспечивает структуру, CSS — стиль и макет, а JavaScript — динамическое поведение и интерактивность.",
    "paragraph_1-2": "Как интерфейсный разработчик, вы будете нести ответственность за создание пользовательского интерфейса веб-сайта, чтобы убедиться, что он хорошо выглядит и прост в использовании, уделяя особое внимание принципам дизайна и пользовательскому опыту. Вы будете тесно сотрудничать с дизайнерами, бэкенд-разработчиками и руководителями проектов, чтобы убедиться, что конечный продукт соответствует потребностям клиента и предоставляет конечным пользователям наилучшие возможности.",
    "article_2-title": "Основы",
    "article_2-label": "Больше о основах",
    "paragraph_2-1": "HTML не является языком программирования — это язык разметки, и используется, чтобы сообщать вашему браузеру, как отображать веб-страницы, которые вы посещаете. Он может быть сложным или простым, в зависимости от того, как хочет веб-дизайнер. HTML состоит из ряда элементов, которые вы используете, чтобы вкладывать или оборачивать различные части контента, чтобы заставить контент отображаться или действовать определённым образом.",
    "paragraph_2-2": "Как и HTML, CSS на самом деле не является языком программирования. Это не язык разметки - это язык таблицы стилей. ",
    "paragraph_2-3": "JavaScript – это язык программирования, который добавляет интерактивность на ваш веб-сайт (например: игры, отклик при нажатии кнопок или при вводе данных в формы, динамические стили, анимация). ",
    "article_3-title": "Git",
    "article_3-label": "Больше о Git",
    "paragraph_3-1": "Git - это консольная утилита, для отслеживания и ведения истории изменения файлов, в вашем проекте. Чаще всего его используют для кода, но можно и для других файлов.",
    "paragraph_3-2": "С помощью Git-a вы можете откатить свой проект до более старой версии, сравнивать, анализировать или сливать свои изменения в репозиторий.",
    "paragraph_3-3": "Репозиторием называют хранилище вашего кода и историю его изменений. Git работает локально и все ваши репозитории хранятся в определенных папках на жестком диске.",
    "article_4-title": "Фреймворки",
    "article_4-label": "Больше о фреймворках",
    "paragraph_4-1": "Фронтенд-фреймворки облегчают работу веб-разработчиков, предоставляя им повторно используемые модули кода, стандартизированные интерфейсные технологии и готовые интерфейсные блоки, которые упрощают разработку приложений и пользовательских интерфейсов без необходимости кодировать каждую функцию или объект с нуля.",
    "paragraph_4-2": "Поскольку большинство веб-приложений имеют очень похожую, а иногда и идентичную структуру, интерфейсные фреймворки были разработаны для предоставления общей структуры, поэтому разработчикам не нужно писать все с нуля",
    "paragraph_4-3": "Вопрос о том, какой интерфейсный фреймворк является лучшим на рынке, всегда вызывал споры. Однако недавние исследования и опросы показывают, что в настоящее время наиболее популярными интерфейсными фреймворками являются React, Vue, Angular, Svelte. ",
    "article_5-title": "Остальные инструменты",
    "article_5-label": "Больше о инструментах",
    "paragraph_5-1": "Фреймворк CSS предоставляет пользователю полнофункциональную таблицу стилей CSS, позволяющую создавать веб-страницы, просто кодируя HTML с соответствующими классами, структурой и идентификаторами.",
    "paragraph_5-2": "Средство проверки типов помогает разработчикам писать код с меньшим количеством ошибок, добавляя типы в свой код, пытаясь отловить ошибки типов в вашем коде, а затем удаляя их во время компиляции.",
    "paragraph_5-3": "Распространенное использование средств запуска задач включает в себя многочисленные задачи разработки, такие как: запуск серверов разработки, компиляция кода (например, SCSS в CSS) и запуск линтеров, обслуживание файлов с локального порта на вашем компьютере.",
    "paragraph_5-4": "Препроцессоры CSS — это языки сценариев, которые расширяют возможности CSS по умолчанию.",
    "article_6-title": "Тесты",
    "article_6-label": "Больше о тестах",
    "paragraph_6-1": "Перед доставкой приложения пользователям необходимо убедиться, что оно соответствует требованиям, для которых оно было разработано, и что оно не делает каких-либо странных, непреднамеренных действий (так называемых «ошибок»).",
    "paragraph_6-2": "Cуществуют множество видов тестов: unit/интеграционные/e2e тесты, пирамиды тестирования, красно‑зелёные рефакторы, TDD и BDD, скриншот‑тестирования.",
    "article_7-title": "Формы web приложений",
    "article_7-label": "Больше о формах web приложений",
    "paragraph_7-1": "Генератор статических сайтов — это инструмент, который создает полноценный статический HTML-сайт на основе исходных данных и набора шаблонов. По сути, генератор статических сайтов автоматизирует задачу кодирования отдельных HTML-страниц и заранее готовит эти страницы для пользователей. Поскольку эти HTML-страницы предварительно созданы, они могут очень быстро загружаться в браузерах пользователей.",
    "paragraph_7-2": "Рендеринг на стороне сервера относится к процессу, в ходе которого сторона службы завершает объединение HTML-структуры страницы, отправляет ее в браузер, а затем привязывает статус и события, чтобы она стала полностью интерактивной страницей.",
    "paragraph_7-3": "Прогрессивные веб-приложения (PWA) — это веб-сайты, которые постепенно улучшаются, чтобы функционировать как установленные собственные приложения на поддерживающих платформах, а в других браузерах — как обычные веб-сайты.",
    "paragraph_7-4": "Некоторое время назад разработка мобильного приложения с использованием JavaScript была невозможна. Но теперь разработчики JavaScript могут создавать мобильные и десктопные приложения, используя свои знания для веб-разработки»."
  }
}
